:PROPERTIES:
:ID:       9fe65007-5820-4452-9c33-8b846c7bafb2
:END:
#+title: yield
#+LAST_MODIFIED: 2025-03-16 15:50:31
#+filetags: :python:
- 一个函数定义中有yield关键字，那这个函数就是个generator函数
- 生成器 是一个 可被迭代的对象
- 调用生成器函数，不会执行此函数，而是返回一个iterable对象
- 生成器也是迭代器，所以可以手动调用next()执行，遇到yield返回，再次调用next()从上次返回的yield处语句继续

- 示例：
#+begin_src python :results output
def foo():
    print("starting...")
    while True:
        res = yield 4
        print("res:",res)
g = foo()
print(next(g))
print("*"*20)
print(next(g))
#+end_src

#+RESULTS:
: starting...
: 4
: ********************
: res: None
: 4
